HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS7 */
#define IFX_CIF_DP_CTRL_UDS7_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS7 */
#define IFX_CIF_DP_CTRL_UDS7_OFF (22)

/** \\brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS8 */
#define IFX_CIF_DP_CTRL_UDS8_LEN (1)

/** \\brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS8 */
#define IFX_CIF_DP_CTRL_UDS8_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS8 */
#define IFX_CIF_DP_CTRL_UDS8_OFF (23)

/** \\brief  Length for Ifx_CIF_DP_FLC_STAT_Bits.FNC_VAL */
#define IFX_CIF_DP_FLC_STAT_FNC_VAL_LEN (15)

/** \\brief  Mask for Ifx_CIF_DP_FLC_STAT_Bits.FNC_VAL */
#define IFX_CIF_DP_FLC_STAT_FNC_VAL_MSK (0x7fff)

/** \\brief  Offset for Ifx_CIF_DP_FLC_STAT_Bits.FNC_VAL */
#define IFX_CIF_DP_FLC_STAT_FNC_VAL_OFF (0)

/** \\brief  Length for Ifx_CIF_DP_FLC_STAT_Bits.LNC_VAL */
#define IFX_CIF_DP_FLC_STAT_LNC_VAL_LEN (15)

/** \\brief  Mask for Ifx_CIF_DP_FLC_STAT_Bits.LNC_VAL */
#define IFX_CIF_DP_FLC_STAT_LNC_VAL_MSK (0x7fff)

/** \\brief  Offset for Ifx_CIF_DP_FLC_STAT_Bits.LNC_VAL */
#define IFX_CIF_DP_FLC_STAT_LNC_VAL_OFF (16)

/** \\brief  Length for Ifx_CIF_DP_PDIV_CTRL_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_CTRL_PDIV_VAL_LEN (32)

/** \\brief  Mask for Ifx_CIF_DP_PDIV_CTRL_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_CTRL_PDIV_VAL_MSK (0xffffffff)

/** \\brief  Offset for Ifx_CIF_DP_PDIV_CTRL_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_CTRL_PDIV_VAL_OFF (0)

/** \\brief  Length for Ifx_CIF_DP_PDIV_STAT_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_STAT_PDIV_VAL_LEN (32)

/** \\brief  Mask for Ifx_CIF_DP_PDIV_STAT_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_STAT_PDIV_VAL_MSK (0xffffffff)

/** \\brief  Offset for Ifx_CIF_DP_PDIV_STAT_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_STAT_PDIV_VAL_OFF (0)

/** \\brief  Length for Ifx_CIF_DP_TSC_STAT_Bits.TSC_VAL */
#define IFX_CIF_DP_TSC_STAT_TSC_VAL_LEN (30)

/** \\brief  Mask for Ifx_CIF_DP_TSC_STAT_Bits.TSC_VAL */
#define IFX_CIF_DP_TSC_STAT_TSC_VAL_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_CIF_DP_TSC_STAT_Bits.TSC_VAL */
#define IFX_CIF_DP_TSC_STAT_TSC_VAL_OFF (0)

/** \\brief  Length for Ifx_CIF_DP_UDS_Bits.UDS */
#define IFX_CIF_DP_UDS_UDS_LEN (15)

/** \\brief  Mask for Ifx_CIF_DP_UDS_Bits.UDS */
#define IFX_CIF_DP_UDS_UDS_MSK (0x7fff)

/** \\brief  Offset for Ifx_CIF_DP_UDS_Bits.UDS */
#define IFX_CIF_DP_UDS_UDS_OFF (0)

/** \\brief  Length for Ifx_CIF_DPCL_Bits.CIF_CHAN_MODE */
#define IFX_CIF_DPCL_CIF_CHAN_MODE_LEN (2)

/** \\brief  Mask for Ifx_CIF_DPCL_Bits.CIF_CHAN_MODE */
#define IFX_CIF_DPCL_CIF_CHAN_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_DPCL_Bits.CIF_CHAN_MODE */
#define IFX_CIF_DPCL_CIF_CHAN_MODE_OFF (2)

/** \\brief  Length for Ifx_CIF_DPCL_Bits.CIF_MP_MUX */
#define IFX_CIF_DPCL_CIF_MP_MUX_LEN (2)

/** \\brief  Mask for Ifx_CIF_DPCL_Bits.CIF_MP_MUX */
#define IFX_CIF_DPCL_CIF_MP_MUX_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_DPCL_Bits.CIF_MP_MUX */
#define IFX_CIF_DPCL_CIF_MP_MUX_OFF (0)

/** \\brief  Length for Ifx_CIF_DPCL_Bits.IF_SELECT */
#define IFX_CIF_DPCL_IF_SELECT_LEN (2)

/** \\brief  Mask for Ifx_CIF_DPCL_Bits.IF_SELECT */
#define IFX_CIF_DPCL_IF_SELECT_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_DPCL_Bits.IF_SELECT */
#define IFX_CIF_DPCL_IF_SELECT_OFF (8)

/** \\brief  Length for Ifx_CIF_EP_IC_CTRL_Bits.IC_EN */
#define IFX_CIF_EP_IC_CTRL_IC_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_EP_IC_CTRL_Bits.IC_EN */
#define IFX_CIF_EP_IC_CTRL_IC_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_EP_IC_CTRL_Bits.IC_EN */
#define IFX_CIF_EP_IC_CTRL_IC_EN_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_DISPLACE_Bits.DX */
#define IFX_CIF_EP_IC_DISPLACE_DX_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_DISPLACE_Bits.DX */
#define IFX_CIF_EP_IC_DISPLACE_DX_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_DISPLACE_Bits.DX */
#define IFX_CIF_EP_IC_DISPLACE_DX_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_DISPLACE_Bits.DY */
#define IFX_CIF_EP_IC_DISPLACE_DY_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_DISPLACE_Bits.DY */
#define IFX_CIF_EP_IC_DISPLACE_DY_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_DISPLACE_Bits.DY */
#define IFX_CIF_EP_IC_DISPLACE_DY_OFF (16)

/** \\brief  Length for Ifx_CIF_EP_IC_H_OFFS_Bits.H_OFFS */
#define IFX_CIF_EP_IC_H_OFFS_H_OFFS_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_H_OFFS_Bits.H_OFFS */
#define IFX_CIF_EP_IC_H_OFFS_H_OFFS_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_H_OFFS_Bits.H_OFFS */
#define IFX_CIF_EP_IC_H_OFFS_H_OFFS_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_H_OFFS_SHD_Bits.H_OFFS_SHD */
#define IFX_CIF_EP_IC_H_OFFS_SHD_H_OFFS_SHD_LEN (13)

/** \\brief  Mask for Ifx_CIF_EP_IC_H_OFFS_SHD_Bits.H_OFFS_SHD */
#define IFX_CIF_EP_IC_H_OFFS_SHD_H_OFFS_SHD_MSK (0x1fff)

/** \\brief  Offset for Ifx_CIF_EP_IC_H_OFFS_SHD_Bits.H_OFFS_SHD */
#define IFX_CIF_EP_IC_H_OFFS_SHD_H_OFFS_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_H_SIZE_Bits.H_SIZE */
#define IFX_CIF_EP_IC_H_SIZE_H_SIZE_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_H_SIZE_Bits.H_SIZE */
#define IFX_CIF_EP_IC_H_SIZE_H_SIZE_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_H_SIZE_Bits.H_SIZE */
#define IFX_CIF_EP_IC_H_SIZE_H_SIZE_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_H_SIZE_SHD_Bits.H_SIZE_SHD */
#define IFX_CIF_EP_IC_H_SIZE_SHD_H_SIZE_SHD_LEN (13)

/** \\brief  Mask for Ifx_CIF_EP_IC_H_SIZE_SHD_Bits.H_SIZE_SHD */
#define IFX_CIF_EP_IC_H_SIZE_SHD_H_SIZE_SHD_MSK (0x1fff)

/** \\brief  Offset for Ifx_CIF_EP_IC_H_SIZE_SHD_Bits.H_SIZE_SHD */
#define IFX_CIF_EP_IC_H_SIZE_SHD_H_SIZE_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_MAX_DX_Bits.MAX_DX */
#define IFX_CIF_EP_IC_MAX_DX_MAX_DX_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_MAX_DX_Bits.MAX_DX */
#define IFX_CIF_EP_IC_MAX_DX_MAX_DX_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_MAX_DX_Bits.MAX_DX */
#define IFX_CIF_EP_IC_MAX_DX_MAX_DX_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_MAX_DY_Bits.MAX_DY */
#define IFX_CIF_EP_IC_MAX_DY_MAX_DY_LEN (12)

/** \\brief  Mask for Ifx_CIF_EP_IC_MAX_DY_Bits.MAX_DY */
#define IFX_CIF_EP_IC_MAX_DY_MAX_DY_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_EP_IC_MAX_DY_Bits.MAX_DY */
#define IFX_CIF_EP_IC_MAX_DY_MAX_DY_OFF (0)

/** \\brief  Length for Ifx_CIF_EP_IC_RECENTER_Bits.RECENTER */
#define IFX_CIF_EP_IC_RECENTER_RECENTER_LEN (3)

/** \\brief  Mask for Ifx_CIF_EP_IC_RECENTER_Bits.RECENTER */
#define IFX_CIF_EP_IC_RECENTER_RECENTER_MSK (0x7)

