HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_SIZE_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_SIZE_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits.MP_CB_SIZE */
#define IFX_CIF_MI_MP_CB_SIZE_SHD_MP_CB_SIZE_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits.MP_CB_SIZE */
#define IFX_CIF_MI_MP_CB_SIZE_SHD_MP_CB_SIZE_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits.MP_CB_SIZE */
#define IFX_CIF_MI_MP_CB_SIZE_SHD_MP_CB_SIZE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_BASE_AD_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_BASE_AD_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_BASE_AD_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits.MP_CR_BASE_AD_INIT */
#define IFX_CIF_MI_MP_CR_BASE_AD_INIT_MP_CR_BASE_AD_INIT_LEN (30)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits.MP_CR_BASE_AD_INIT */
#define IFX_CIF_MI_MP_CR_BASE_AD_INIT_MP_CR_BASE_AD_INIT_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits.MP_CR_BASE_AD_INIT */
#define IFX_CIF_MI_MP_CR_BASE_AD_INIT_MP_CR_BASE_AD_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_BASE_AD_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_BASE_AD_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_BASE_AD_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits.MP_CR_BASE_AD */
#define IFX_CIF_MI_MP_CR_BASE_AD_SHD_MP_CR_BASE_AD_LEN (30)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits.MP_CR_BASE_AD */
#define IFX_CIF_MI_MP_CR_BASE_AD_SHD_MP_CR_BASE_AD_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits.MP_CR_BASE_AD */
#define IFX_CIF_MI_MP_CR_BASE_AD_SHD_MP_CR_BASE_AD_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits.MP_CR_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_INIT_MP_CR_OFFS_CNT_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits.MP_CR_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_INIT_MP_CR_OFFS_CNT_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits.MP_CR_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_INIT_MP_CR_OFFS_CNT_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.MP_CR_OFFS_CNT */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_MP_CR_OFFS_CNT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.MP_CR_OFFS_CNT */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_MP_CR_OFFS_CNT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.MP_CR_OFFS_CNT */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_MP_CR_OFFS_CNT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_START_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_START_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_START_FIXED_TO_00_OFF (0)

/** \\brief  Length for
 * Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits.MP_CR_OFFS_CNT_START */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_START_MP_CR_OFFS_CNT_START_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits.MP_CR_OFFS_CNT_START */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_START_MP_CR_OFFS_CNT_START_MSK (0x3fffff)

/** \\brief  Offset for
 * Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits.MP_CR_OFFS_CNT_START */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_START_MP_CR_OFFS_CNT_START_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits.MP_CR_SIZE_INIT */
#define IFX_CIF_MI_MP_CR_SIZE_INIT_MP_CR_SIZE_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits.MP_CR_SIZE_INIT */
#define IFX_CIF_MI_MP_CR_SIZE_INIT_MP_CR_SIZE_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits.MP_CR_SIZE_INIT */
#define IFX_CIF_MI_MP_CR_SIZE_INIT_MP_CR_SIZE_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.MP_CR_SIZE */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_MP_CR_SIZE_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.MP_CR_SIZE */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_MP_CR_SIZE_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.MP_CR_SIZE */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_MP_CR_SIZE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.MP_Y_BASE_AD_INIT */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_MP_Y_BASE_AD_INIT_LEN (30)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.MP_Y_BASE_AD_INIT */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_MP_Y_BASE_AD_INIT_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.MP_Y_BASE_AD_INIT */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_MP_Y_BASE_AD_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.MP_Y_BASE_AD */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_MP_Y_BASE_AD_LEN (30)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.MP_Y_BASE_AD */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_MP_Y_BASE_AD_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.MP_Y_BASE_AD */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_MP_Y_BASE_AD_OFF (2)

