HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_OFF (3)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_OFF (5)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_OFF (6)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_OFF (4)

/** \\brief  Length for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_OFF (8)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_OFF (8)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_OFF (24)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_OFF (25)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_OFF (26)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_OFF (27)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_OFF (28)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_OFF (1)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_OFF (1)

/** \\brief  Length for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_OFF (2)

