HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_bf.h
/** \\brief  Length for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_EP_OFFS_CNT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_EP_OFFS_CNT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_EP_OFFS_CNT_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_EP_OFFS_CNT_START_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_EP_OFFS_CNT_START_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_EP_OFFS_CNT_START_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_SIZE_INIT_EP_SIZE_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_SIZE_INIT_EP_SIZE_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_SIZE_INIT_EP_SIZE_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_SIZE_SHD_EP_SIZE_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_SIZE_SHD_EP_SIZE_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_SIZE_SHD_EP_SIZE_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_ICR_FILL_EP_1_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_ICR_FILL_EP_1_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_ICR_FILL_EP_1_OFF (1)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_ICR_FILL_EP_2_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_ICR_FILL_EP_2_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_ICR_FILL_EP_2_OFF (5)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_ICR_FILL_EP_3_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_ICR_FILL_EP_3_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_ICR_FILL_EP_3_OFF (9)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_ICR_FILL_EP_4_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_ICR_FILL_EP_4_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_ICR_FILL_EP_4_OFF (13)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_ICR_FILL_EP_5_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_ICR_FILL_EP_5_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_ICR_FILL_EP_5_OFF (17)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_1_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_1_MSK (0x1)

