HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_OFF (3)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_OFF (4)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_OFF (5)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_OFF (17)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_OFF (1)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_OFF (18)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_2_IC_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_2_IC_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_2_IC_SIZE_ERR_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_3_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_3_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_3_FIFO_FULL_OFF (19)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_3_IC_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_3_IC_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_3_IC_SIZE_ERR_OFF (3)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_4_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_4_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_4_FIFO_FULL_OFF (20)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_4_IC_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_4_IC_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_4_IC_SIZE_ERR_OFF (4)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_5_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_5_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_5_FIFO_FULL_OFF (21)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_5_IC_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_5_IC_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_5_IC_SIZE_ERR_OFF (5)

/** \\brief  Length for Ifx_CIF_WD_CTRL_Bits.RST_H_CNT */
#define IFX_CIF_WD_CTRL_RST_H_CNT_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_CTRL_Bits.RST_H_CNT */
#define IFX_CIF_WD_CTRL_RST_H_CNT_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_CTRL_Bits.RST_H_CNT */
#define IFX_CIF_WD_CTRL_RST_H_CNT_OFF (1)

/** \\brief  Length for Ifx_CIF_WD_CTRL_Bits.RST_PD_CNT */
#define IFX_CIF_WD_CTRL_RST_PD_CNT_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_CTRL_Bits.RST_PD_CNT */
#define IFX_CIF_WD_CTRL_RST_PD_CNT_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_CTRL_Bits.RST_PD_CNT */
#define IFX_CIF_WD_CTRL_RST_PD_CNT_OFF (3)

/** \\brief  Length for Ifx_CIF_WD_CTRL_Bits.RST_V_CNT */
#define IFX_CIF_WD_CTRL_RST_V_CNT_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_CTRL_Bits.RST_V_CNT */
#define IFX_CIF_WD_CTRL_RST_V_CNT_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_CTRL_Bits.RST_V_CNT */
#define IFX_CIF_WD_CTRL_RST_V_CNT_OFF (2)

/** \\brief  Length for Ifx_CIF_WD_CTRL_Bits.WD_EN */
#define IFX_CIF_WD_CTRL_WD_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_CTRL_Bits.WD_EN */
#define IFX_CIF_WD_CTRL_WD_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_CTRL_Bits.WD_EN */
#define IFX_CIF_WD_CTRL_WD_EN_OFF (0)

/** \\brief  Length for Ifx_CIF_WD_CTRL_Bits.WD_PREDIV */
#define IFX_CIF_WD_CTRL_WD_PREDIV_LEN (16)

/** \\brief  Mask for Ifx_CIF_WD_CTRL_Bits.WD_PREDIV */
#define IFX_CIF_WD_CTRL_WD_PREDIV_MSK (0xffff)

/** \\brief  Offset for Ifx_CIF_WD_CTRL_Bits.WD_PREDIV */
#define IFX_CIF_WD_CTRL_WD_PREDIV_OFF (16)

/** \\brief  Length for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HES_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HES_TO_LEN (16)

/** \\brief  Mask for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HES_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HES_TO_MSK (0xffff)

/** \\brief  Offset for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HES_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HES_TO_OFF (16)

/** \\brief  Length for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HSE_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HSE_TO_LEN (16)

/** \\brief  Mask for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HSE_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HSE_TO_MSK (0xffff)

/** \\brief  Offset for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HSE_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HSE_TO_OFF (0)

