HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_bf.h
/** \\brief  Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_HES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_HES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_HES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HES_TO_OFF (1)

/** \\brief  Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_HSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_HSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_HSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HSE_TO_OFF (0)

/** \\brief  Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_VES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_VES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_VES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VES_TO_OFF (3)

/** \\brief  Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_VSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_VSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_VSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VSE_TO_OFF (2)

/** \\brief  Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HES_TO_OFF (1)

/** \\brief  Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HSE_TO_OFF (0)

/** \\brief  Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VES_TO_OFF (3)

/** \\brief  Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VSE_TO_OFF (2)

/** \\brief  Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_HES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_HES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_HES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HES_TO_OFF (1)

/** \\brief  Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_HSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_HSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_HSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HSE_TO_OFF (0)

/** \\brief  Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_VES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_VES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_VES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VES_TO_OFF (3)

/** \\brief  Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_VSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_VSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_VSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VSE_TO_OFF (2)

/** \\brief  Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_HES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_HES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_HES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HES_TO_OFF (1)

/** \\brief  Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_HSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_HSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_HSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HSE_TO_OFF (0)

/** \\brief  Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_VES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_VES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_VES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VES_TO_OFF (3)

/** \\brief  Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_VSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_VSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_VSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VSE_TO_OFF (2)

/** \\brief  Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_HES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_HES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_HES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HES_TO_OFF (1)

/** \\brief  Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_HSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_HSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_HSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HSE_TO_OFF (0)

/** \\brief  Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_VES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VES_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_VES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VES_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_VES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VES_TO_OFF (3)

/** \\brief  Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_VSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VSE_TO_LEN (1)

/** \\brief  Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_VSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VSE_TO_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_VSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VSE_TO_OFF (2)

/** \\brief  Length for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VES_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VES_TO_LEN (16)

/** \\brief  Mask for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VES_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VES_TO_MSK (0xffff)

/** \\brief  Offset for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VES_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VES_TO_OFF (16)

/** \\brief  Length for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VSE_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VSE_TO_LEN (16)

/** \\brief  Mask for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VSE_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VSE_TO_MSK (0xffff)

/** \\brief  Offset for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VSE_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VSE_TO_OFF (0)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCIF_BF_H */
